; domain
(define (domain haul-truck-dispatch)
  (:requirements :strips :typing :negative-preconditions)

  (:types truck load location)

  (:predicates
    (at ?t - truck ?loc - location)
    (connected ?from - location ?to - location)
    (load-at ?l - load ?loc - location)
    (carrying ?t - truck ?l - load)
    (free ?t - truck)
    (delivered ?l - load)
    (ore ?l - load)
    (waste ?l - load)
    (mill ?loc - location)
    (dump ?loc - location)
  )

  (:action move
    :parameters (?t - truck ?from - location ?to - location)
    :precondition (and (at ?t ?from) (connected ?from ?to))
    :effect (and (at ?t ?to) (not (at ?t ?from)))
  )

  (:action pick-up
    :parameters (?t - truck ?l - load ?loc - location)
    :precondition (and (at ?t ?loc) (load-at ?l ?loc) (free ?t))
    :effect (and (carrying ?t ?l) (not (free ?t)) (not (load-at ?l ?loc)))
  )

  (:action deliver-ore
    :parameters (?t - truck ?l - load ?loc - location)
    :precondition (and (at ?t ?loc) (carrying ?t ?l) (ore ?l) (mill ?loc))
    :effect (and (delivered ?l) (free ?t) (not (carrying ?t ?l)))
  )

  (:action deliver-waste
    :parameters (?t - truck ?l - load ?loc - location)
    :precondition (and (at ?t ?loc) (carrying ?t ?l) (waste ?l) (dump ?loc))
    :effect (and (delivered ?l) (free ?t) (not (carrying ?t ?l)))
  )
)

; problem
(define (problem mine-scenario-2)
  (:domain haul-truck-dispatch)

  (:objects
    truck1 truck2 - truck
    ore1 ore2 waste1 - load
    yard pit-a pit-b pit-c jct mill dump - location
  )

  (:init
    (at truck1 yard)
    (at truck2 yard)
    (free truck1)
    (free truck2)

    (load-at ore1 pit-a)
    (ore ore1)
    (load-at ore2 pit-c)
    (ore ore2)
    (load-at waste1 pit-b)
    (waste waste1)

    (mill mill)
    (dump dump)

    (connected yard pit-a)
    (connected yard pit-b)
    (connected yard pit-c)
    (connected pit-a jct)
    (connected pit-b jct)
    (connected pit-c jct)
    (connected jct mill)
    (connected jct dump)
    (connected mill yard)
    (connected dump yard)
  )

  (:goal (and (delivered ore1) (delivered ore2) (delivered waste1)))
)

; plan
1. (move truck1 yard pit-a)
   deleted: (at truck1 yard)
   added: (at truck1 pit-a)
   goals met: 0 of 3
2. (move truck2 yard pit-b)
   deleted: (at truck2 yard)
   added: (at truck2 pit-b)
   goals met: 0 of 3
3. (pick-up truck1 ore1 pit-a)
   deleted: (free truck1) (load-at ore1 pit-a)
   added: (carrying truck1 ore1)
   goals met: 0 of 3
4. (move truck1 pit-a jct)
   deleted: (at truck1 pit-a)
   added: (at truck1 jct)
   goals met: 0 of 3
5. (pick-up truck2 waste1 pit-b)
   deleted: (free truck2) (load-at waste1 pit-b)
   added: (carrying truck2 waste1)
   goals met: 0 of 3
6. (move truck2 pit-b jct)
   deleted: (at truck2 pit-b)
   added: (at truck2 jct)
   goals met: 0 of 3
7. (move truck1 jct mill)
   deleted: (at truck1 jct)
   added: (at truck1 mill)
   goals met: 0 of 3
8. (move truck2 jct dump)
   deleted: (at truck2 jct)
   added: (at truck2 dump)
   goals met: 0 of 3
9. (deliver-ore truck1 ore1 mill)
   deleted: (carrying truck1 ore1)
   added: (delivered ore1) (free truck1)
   goals met: 1 of 3
10. (deliver-waste truck2 waste1 dump)
   deleted: (carrying truck2 waste1)
   added: (delivered waste1) (free truck2)
   goals met: 2 of 3
11. (move truck2 dump yard)
   deleted: (at truck2 dump)
   added: (at truck2 yard)
   goals met: 2 of 3
12. (move truck2 yard pit-c)
   deleted: (at truck2 yard)
   added: (at truck2 pit-c)
   goals met: 2 of 3
13. (pick-up truck2 ore2 pit-c)
   deleted: (free truck2) (load-at ore2 pit-c)
   added: (carrying truck2 ore2)
   goals met: 2 of 3
14. (move truck2 pit-c jct)
   deleted: (at truck2 pit-c)
   added: (at truck2 jct)
   goals met: 2 of 3
15. (move truck2 jct mill)
   deleted: (at truck2 jct)
   added: (at truck2 mill)
   goals met: 2 of 3
16. (deliver-ore truck2 ore2 mill)
   deleted: (carrying truck2 ore2)
   added: (delivered ore2) (free truck2)
   goals met: 3 of 3
